Revit 2024 API
BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatWarning Property
 The resulting angle between the segments is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SegmentsAngleTooGreatWarning { get; }
Visual Basic
Public Shared ReadOnly Property SegmentsAngleTooGreatWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SegmentsAngleTooGreatWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace